# AlignDistribute3D

## Description
3D Object Alignment/Distribution

```pascal
PROCEDURE AlignDistribute3D(
				MenuAction           : LONGINT;
				VAR AlignDist3DParms : LONGINT);
```

```python
def vs.AlignDistribute3D(MenuAction):
    return AlignDist3DParms
```

## Parameters
|Name|Type|Description|
|---|---|---|
|MenuAction|LONGINT|   |
|AlignDist3DParms|LONGINT|   |

## Examples
```pascal
AlignDistribute3D(1, 2);
```
```python
import vs

# 3D Object Alignment/Distribution.
MenuAction = 1

result = vs.AlignDistribute3D(MenuAction)
```

## Version
Availability: from Vectorworks 2014

## Category
* General Edit